# 1.	Дан список чисел. Определите, сколько в нем встречается различных чисел.
# Входные данные	Выходные данные
# 1 5 2 2 2 4	     4

sp = [1, 5, 2, 2, 2, 4]
print(len(set(sp)))